"""
① 二进制转十进制
规则：从最低位（右边）开始，将每个位上的数提取出来，乘以2的（位数-1)次方，然后求和
demo1：将0b1011转为十进制
0b1011 = 1 * (2**0) + 1 * (2**1) + 0 * (2**2) + 1 * (2**3) = 1 + 2 + 0 + 8 = 11

② 八进制转十进制
规则：从最低位（右边）开始，将每个位上的数提取出来，乘以8的（位数-1)次方，然后求和
demo2：将0o234转为十进制
0o234 = 4 * (8**0) + 3 * (8**1) + 2 * (8**2) = 4 + 24 + 128 = 156

③ 八进制转十进制
规则：从最低位（右边）开始，将每个位上的数提取出来，乘以16的（位数-1)次方，然后求和
demo3：将0x23A转为十进制
0x23A = 10 * (16**0) + 3 * (16**1) + 2 * (16**2) = 10 + 48 + 512 = 570

"""

# 验证
print(0b1011)  # 11
print(0o234)  # 156
print(0x23A)  # 570
