"""
元组的常用操作 (用法与列表类似)

- 函数
    1、len(tuple):返回元组元素个数
    2、max(tuple):返回元组元素最大值
    3、min(tuple):返回元组元素最小值

- 方法
    1、tuple.count(obj):统计某个元素在元组中出现的次数
    2、tuple.index(obj):从元组中找出某个值第一个匹配项的索引值
"""

print("---" * 20)
content = """
定义一个元组，('大话西游','周星驰',80,['周星驰','小甜甜']),信息为(片名,导演,票价,演员列表)
1、查询票价对应的索引
2、遍历所有演员
3、删除’小甜甜‘，增加演员'牛魔王'、’猪八戒‘
"""
print(f"demo:{content}")
tuple1 = ('大话西游', '周星驰', 80, ['周星驰', '小甜甜'])
# 1、查询票价对应的索引
print(tuple1.index(80))  # 2
# 2、遍历所有演员
for i in tuple1[3]:
    print(i)
# 3、删除’小甜甜‘
del tuple1[3][1]
print(tuple1)  # ('大话西游', '周星驰', 80, ['周星驰'])
# 4、增加演员'牛魔王'、'猪八戒'
list1 = ['牛魔王', '猪八戒']
tuple1[3].extend(list1)
print(tuple1)  # ('大话西游', '周星驰', 80, ['周星驰', '牛魔王', '猪八戒'])
