# =赋值, +=复合加法赋值, -=复合减法赋值, *=复合乘法赋值, /=复合除法赋值, %=复合取模赋值, **=复合幂赋值, //=复合取整除赋值

# c = a + b 将 a + b的运算结果赋值为c
c = 10 + 20
print(c)  # 30

# c += a 等效于 c = c + a
c += 10
print(c)  # c = 30 + 10 = 40

# c -=a 等效于 c = c - a
c -= 20
print(c)  # c = 40 - 20 = 20

# c *= a 等效于 c = c * a
c *= 10
print(c)  # c = 20 * 10 = 200

# c /= a 等效于 c = c / a
c /= 10
print(c)  # c = 200 / 10 = 20.0

# c %= a 等效于 c= c % a
c %= 3
print(c)  # c = 20.0 % 3 = 2.0

# c **= a 等效于 c = c ** a
c **= 4
print(c)  # c = 2.0 ** 4 = 16.0

# c //= a 等效于 c = c // a
c //= 5
print(c)  # c = 16.0 // 5 = 3.0

print("---" * 20)
# demo:有两个变量，a 和 b，需求：将二者的值交换并打印结果
a = 30
b = 40
# ①使用中间变量来实现变量交换
print(f"未交换前 a={a},b={b}")  # 未交换前 a=30,b=40
temp = a
a = b
b = temp
print(f"交换后 a={a},b={b}")  # 交换后 a=40,b=30

# ②在Python中支持一个简单的实现变量交换方式：x,y = y,x
print(f"未交换前 a={a},b={b}")  # 未交换前 a=30,b=40
a, b = b, a
print(f"交换后 a={a},b={b}")  # 交换后 a=40,b=30

# ③不使用中间变量
print(f"未交换前 a={a},b={b}")  # 未交换前 a=30,b=40
a = a + b
b = a - b  # b = (a + b) - b = a
a = a - b  # a = (a + b) - a = b
print(f"交换后 a={a},b={b}")  # 交换后 a=40,b=30
